#+TITLE: Processes

This is an exploration of running processes in Emacs.

The easiest part is getting the result of a
command into a string which is useful

However, something special about Emacs it it's buffer-centric.  So outputs of
commands actually go into buffers and the first part where we get it into a
string is actually a convenience functionadded on top of the main process
launching functions.

I used my repos tool for it. 

Note too that =call-process= can use a pty for a process.

* Repos major mode

Define a keymap.

#+begin_src emacs-lisp
(defvar-keymap repos-mode-map
  :doc "Keymap for `repos-mode'."
  :parent nil
  "RET" #'repos-magit-repo-at-point
  "g" #'repos-open-at-point
  "f" #'repos-find-files-at-point
  "s" #'repos-shell-at-point
  "q" #'quit-window)
#+end_src

#+RESULTS:
: repos-mode-map

Define a major mode.  The name of the keymap is associated to the major mode
simply by the name it seems.

I am deriving from =special-mode= because looking at what =magit= does, I found
out that all its major modes end up deriving from this mode.  And the
documentation for it says that it's the mode to view specifically formatted data
rather than files.

#+begin_src emacs-lisp
(define-derived-mode repos-mode special-mode "Repos"
  "This is my major mode"
  :interactive t
  :group 'repos)
#+end_src

I'm not sure how it works but it seems both of these hooks are necessary for my
buffer to not have visually wrapped lines when I enter =repos-mode=.

If I didn't have these hooks, I could visit the buffer and only enter =M-x
toggle-truncate-lines RET= and have truncated lines.

#+begin_src emacs-lisp
(add-hook 'repos-mode-hook (lambda () (toggle-truncate-lines 1)))
(add-hook 'repos-mode-hook (lambda () (visual-line-mode -1)))
#+end_src

For evil-mode, we have to do a bit of extra work because even if I have a major
mode enabled that defines keybindings, the =evil-mode= bindings seem to take
priority anyway.

#+begin_src emacs-lisp
(evil-define-key 'motion repos-mode-map
  (kbd "RET") 'repos-magit-repo-at-point
  (kbd "f") 'repos-find-files-at-point)
(evil-define-key 'normal repos-mode-map
  (kbd "g") 'repos-open-at-point
  (kbd "s") 'repos-shell-at-point
  (kbd "q") 'quit-window)
(add-hook 'repos-mode-hook 'evil-normalize-keymaps)
#+end_src

#+RESULTS:
| evil-normalize-keymaps | (lambda nil (visual-line-mode -1)) | (lambda nil (toggle-truncate-lines 1)) |
  
